In [3]:
import pandas as pd
import numpy as np

In [2]:
# easiest way to create series is through list and arrays
mylist = [5.4, 6.1, 1.7, 99.8]
myarray = np.array(mylist)

In [4]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [5]:
#access cell
print(myseries1[0])

5.4

In [6]:
#create labels to entries of a series
mylabels = ['first', 'second', 'third', 'fourth']
myseries3 = pd.Series(data=mylist, index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [9]:
#or 
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [10]:
print(myseries4['second'])

6.1

In [12]:
# can do math on series. Label is the correleation id during math between two series. NaN b/c series label is not found
myseries5 = pd.Series([5.5,1.1,8.8,1.6], ['first', 'third', 'fourth', 'fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.9
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [13]:
# can do concat two series to create dataframe
df1 = pd.concat([myseries4, myseries5], axis=1, sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [14]:
# axis 0 stacks two series one over another
zzdf1 = pd.concat([myseries4, myseries5], axis=0, sort=False)
zzdf1

first      5.4
second     6.1
third      1.7
fourth    99.8
first      5.5
third      1.1
fourth     8.8
fifth      1.6
dtype: float64

In [15]:
# pd.DataFrame can be used to create dataframe as well
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  0.130337 -0.499812  2.209784  0.040506 -0.597592
1 -0.290392  0.579140 -0.807361  0.590733 -0.111571
2 -1.197040 -0.120413 -1.021262  0.579281 -1.109757
3 -0.398302  0.630598 -0.266746 -0.359639  0.167183
4 -0.551412  0.139798  0.322534 -0.462264  0.496114

In [16]:
#labels to rows (index) and columns (columns)
df3 = pd.DataFrame(np.random.randn(5,5), index=['first row', 'second row', 'third row', 'fourth row', 'fifth row'],
                  columns=['first col', 'second col', 'third col', 'fourth col', 'fifth col'] )
df3

            first col  second col  third col  fourth col  fifth col
first row   -0.376889    1.442449  -0.550899   -0.424235  -0.200271
second row  -1.697397   -0.334572   1.184084   -0.172487  -1.987909
third row    0.962956    0.453435   0.352161    0.207854  -0.257387
fourth row   0.987294   -1.349073  -1.048137   -0.082712   0.191421
fifth row    0.901745    0.659924   0.270143    1.496105   0.069115

In [18]:
# accessing
print(df3['second col']) # <- single label will fetch only columns and not rows. b/c df is multiple series(columns)
print('')
df3[['third col', 'first col']]

first row     1.442449
second row   -0.334572
third row     0.453435
fourth row   -1.349073
fifth row     0.659924
Name: second col, dtype: float64

            third col  first col
first row   -0.550899  -0.376889
second row   1.184084  -1.697397
third row    0.352161   0.962956
fourth row  -1.048137   0.987294
fifth row    0.270143   0.901745

In [19]:
#loc (location) fetches row in series (vertical). Notice not a method
df3.loc['first row']

first col    -0.376889
second col    1.442449
third col    -0.550899
fourth col   -0.424235
fifth col    -0.200271
Name: first row, dtype: float64

In [20]:
#iloc to fetch row using index
df3.iloc[1]

first col    -1.697397
second col   -0.334572
third col     1.184084
fourth col   -0.172487
fifth col    -1.987909
Name: second row, dtype: float64

In [21]:
# loc to get both row and column
df3.loc[['fourth row', 'first row'], ['second col', 'third col']]

            second col  third col
fourth row   -1.349073  -1.048137
first row     1.442449  -0.550899

In [22]:
# logical conditions
df3 > 0

            first col  second col  third col  fourth col  fifth col
first row       False        True      False       False      False
second row      False       False       True       False      False
third row        True        True       True        True      False
fourth row       True       False      False       False       True
fifth row        True        True       True        True       True

In [23]:
print(df3[df3>0]) #compare the result with matrix. table structure is maintained

            first col  second col  third col  fourth col  fifth col
first row         NaN    1.442449        NaN         NaN        NaN
second row        NaN         NaN   1.184084         NaN        NaN
third row    0.962956    0.453435   0.352161    0.207854        NaN
fourth row   0.987294         NaN        NaN         NaN   0.191421
fifth row    0.901745    0.659924   0.270143    1.496105   0.069115

In [24]:
#add col
df3['sixth col'] = np.random.randn(5,1)
df3

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -0.376889    1.442449  -0.550899   -0.424235  -0.200271  -0.956202
second row  -1.697397   -0.334572   1.184084   -0.172487  -1.987909   0.476543
third row    0.962956    0.453435   0.352161    0.207854  -0.257387  -0.088573
fourth row   0.987294   -1.349073  -1.048137   -0.082712   0.191421   0.454294
fifth row    0.901745    0.659924   0.270143    1.496105   0.069115  -0.508511

In [25]:
#drop col
df3.drop('first col', axis = 1) #<- why axis = 1

            second col  third col  fourth col  fifth col  sixth col
first row     1.442449  -0.550899   -0.424235  -0.200271  -0.956202
second row   -0.334572   1.184084   -0.172487  -1.987909   0.476543
third row     0.453435   0.352161    0.207854  -0.257387  -0.088573
fourth row   -1.349073  -1.048137   -0.082712   0.191421   0.454294
fifth row     0.659924   0.270143    1.496105   0.069115  -0.508511

In [26]:
df3 # first col not dropped yet.

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -0.376889    1.442449  -0.550899   -0.424235  -0.200271  -0.956202
second row  -1.697397   -0.334572   1.184084   -0.172487  -1.987909   0.476543
third row    0.962956    0.453435   0.352161    0.207854  -0.257387  -0.088573
fourth row   0.987294   -1.349073  -1.048137   -0.082712   0.191421   0.454294
fifth row    0.901745    0.659924   0.270143    1.496105   0.069115  -0.508511

In [27]:
df4 = df3.drop('first col', axis=1) #d3 = d3.drop... is fine too

In [28]:
df4

            second col  third col  fourth col  fifth col  sixth col
first row     1.442449  -0.550899   -0.424235  -0.200271  -0.956202
second row   -0.334572   1.184084   -0.172487  -1.987909   0.476543
third row     0.453435   0.352161    0.207854  -0.257387  -0.088573
fourth row   -1.349073  -1.048137   -0.082712   0.191421   0.454294
fifth row     0.659924   0.270143    1.496105   0.069115  -0.508511

In [35]:
df5 = df3.drop('second row', axis = 0) # <- removed rows 
df5

            first col  second col  third col  fourth col  fifth col  sixth col
first row   -0.376889    1.442449  -0.550899   -0.424235  -0.200271  -0.956202
third row    0.962956    0.453435   0.352161    0.207854  -0.257387  -0.088573
fourth row   0.987294   -1.349073  -1.048137   -0.082712   0.191421   0.454294
fifth row    0.901745    0.659924   0.270143    1.496105   0.069115  -0.508511

In [30]:
#removing dataframe's label but converts into series.
df5.reset_index()

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,-0.376889,1.442449,-0.550899,-0.424235,-0.200271,-0.956202
1,third row,0.962956,0.453435,0.352161,0.207854,-0.257387,-0.088573
2,fourth row,0.987294,-1.349073,-1.048137,-0.082712,0.191421,0.454294
3,fifth row,0.901745,0.659924,0.270143,1.496105,0.069115,-0.508511

In [36]:
#inplace=true argument to save the changes
df5.reset_index(inplace=True) # works for drop as well
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
0,first row,-0.376889,1.442449,-0.550899,-0.424235,-0.200271,-0.956202
1,third row,0.962956,0.453435,0.352161,0.207854,-0.257387,-0.088573
2,fourth row,0.987294,-1.349073,-1.048137,-0.082712,0.191421,0.454294
3,fifth row,0.901745,0.659924,0.270143,1.496105,0.069115,-0.508511

In [37]:
#add new index names
df5['new name'] = ['new first row', 'new second row', 'new third row', 'new fourth row']

In [38]:
df5
df5.set_index('new name', inplace=True)
df5

,index,first col,second col,third col,fourth col,fifth col,sixth col
new name,,,,,,,
new first row,first row,-0.376889,1.442449,-0.550899,-0.424235,-0.200271,-0.956202
new second row,third row,0.962956,0.453435,0.352161,0.207854,-0.257387,-0.088573
new third row,fourth row,0.987294,-1.349073,-1.048137,-0.082712,0.191421,0.454294
new fourth row,fifth row,0.901745,0.659924,0.270143,1.496105,0.069115,-0.508511

## Combining dataframe
1. concat
2. join
3. merge

In [46]:
df7 = pd.DataFrame({"customer": ['101', '102', '103', '104'],
                    'category':['cat2', 'cat2', 'cat1', 'cat3'],
                    'important': ['yes', 'no', 'yes', 'yes'],
                    'sales': [123, 52, 214, 663]}) #, index=[0,1,2,3]

df8 = pd.DataFrame({"customer": ['101', '103', '104', '105'],
                    'color':['yellow', 'green', 'green', 'blue'],
                    'distance': [12,9,44,21],
                    'sales': [123, 214, 663, 331]}) #, index=[4,5,6,7]

In [20]:
df9 = pd.DataFrame({"customer": ['101', '102', '103', '104'],
                    'category':['cat2', 'cat2', 'cat1', 'cat3'],
                    'important': ['yes', 'no', 'yes', 'yes'],
                    'sales': [123, 52, 214, 663]}, index=[0,1,2,3])

df10 = pd.DataFrame({"customer": ['101', '103', '104', '105'],
                    'color':['yellow', 'green', 'green', 'blue'],
                    'distance': [12,9,44,21],
                    'sales': [123, 214, 663, 331]}, index=[4,5,6,7])

In [6]:
pd.concat([df7,df8], axis=0, sort=False) # row wise concat; stack one over another

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
0      101      NaN       NaN    123  yellow      12.0
1      103      NaN       NaN    214   green       9.0
2      104      NaN       NaN    663   green      44.0
3      105      NaN       NaN    331    blue      21.0

In [10]:
pd.concat([df9,df10], axis=0, sort=False) # row wise concat; stack one over another

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [7]:
pd.concat([df7,df8], axis=0, sort=True) # row wise concat with sorted data

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
0      NaN  yellow      101      12.0       NaN    123
1      NaN   green      103       9.0       NaN    214
2      NaN   green      104      44.0       NaN    663
3      NaN    blue      105      21.0       NaN    331

In [11]:
pd.concat([df9,df10], axis=0, sort=True) # row wise concat with sorted data

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [8]:
pd.concat([df7,df8], axis=1, sort=True) # col wise concat

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes    123      101  yellow        12    123
1      102     cat2        no     52      103   green         9    214
2      103     cat1       yes    214      104   green        44    663
3      104     cat3       yes    663      105    blue        21    331

In [12]:
pd.concat([df9,df10], axis=1, sort=True) # col wise concat

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

## Merge and Join

merge - combines df using column's values to identify entries
join - combines df using the index to identify common entries

In [15]:
pd.merge(df7, df8, how='outer', on='customer') # outer merge is union of on, 
#columns with same name will be renamed expect for column on "on" which will be merge

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [16]:
pd.merge(df7, df8, how='inner', on='customer') # inner merge is union of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [18]:
pd.merge(df7, df8, how='left', on='customer') # left merge is just first df on, but all columns..

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0

In [17]:
pd.merge(df7, df8, how='right', on='customer') # right merge is just second df on, but all columns..

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

## Join - similar to merge but it joins based on index values

syntax differences
merge is a function of pd.
join is a function on df.

In [21]:
df11 = pd.DataFrame({'Q1': [101, 102, 103], 'Q2': [201, 202, 203]}, index=['I0', 'I1', 'I2'])
df12 = pd.DataFrame({'Q3': [301, 302, 303], 'Q4': [401, 402, 403]}, index=['I0', 'I2', 'I3'])

In [22]:
df11.join(df12, how='outer') # outer, inner, left, right

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  203.0  302.0  402.0
I3    NaN    NaN  303.0  403.0

In [23]:
# other basic functionalities
df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [24]:
df8['color'].value_counts()

green     2
blue      1
yellow    1
Name: color, dtype: int64

In [25]:
df8.mean()

customer    2.527578e+10
distance    2.150000e+01
sales       3.327500e+02
dtype: float64

In [30]:

df11['Q1'].mean()

102.0

In [32]:
df11['Q1']

I0    101
I1    102
I2    103
Name: Q1, dtype: int64

In [33]:
df11.columns

Index(['Q1', 'Q2'], dtype='object')

In [34]:
df8.columns

Index(['customer', 'color', 'distance', 'sales'], dtype='object')

In [36]:
# filter from df
new_df = df8[(df8['customer']!='105') & (df8['color']!='green')]
new_df

  customer   color  distance  sales
0      101  yellow        12    123

In [37]:
df11['Q1'].min()

101

In [38]:
# functions. invoke using apply and applymap

def profit(s):
    return s*0.5 # 50% markup

In [39]:
df8['sales'].apply(profit) # apply works on one series

0     61.5
1    107.0
2    331.5
3    165.5
Name: sales, dtype: float64

In [40]:
df8['color'].apply(len)

0    6
1    5
2    5
3    4
Name: color, dtype: int64

In [42]:
df13 = df8[['distance', 'sales']] #applymap works on multiple series (df) and returns df (applies for series by series)
df13.applymap(profit)

   distance  sales
0       6.0   61.5
1       4.5  107.0
2      22.0  331.5
3      10.5  165.5

In [43]:
#applymap throws error when you use function that aggregrate functions

In [47]:
#del
del df8['color']
df8

  customer  distance  sales
0      101        12    123
1      103         9    214
2      104        44    663
3      105        21    331

In [49]:
#index
df8.index

RangeIndex(start=0, stop=4, step=1)

In [51]:
#sort
df8.sort_values(by='distance', inplace=True)
df8

  customer  distance  sales
1      103         9    214
0      101        12    123
3      105        21    331
2      104        44    663

In [52]:
#group
mydict = {'customer': ['Customer 1', 'Customer 1', 'Customer 2', 'Customer 2', 'Customer 3', 'Customer 3'],
          'product1': [1.1,2.1,3.8,4.2,5.5,6.9],
         'product2': [8.2,9.1,11.1,5.2,44.66,983]}
df14 = pd.DataFrame(mydict, index=['Purchase 1', 'Purchase 2','Purchase 3', 'Purchase 4','Purchase 5', 'Purchase 6'])
df14

              customer  product1  product2
Purchase 1  Customer 1       1.1      8.20
Purchase 2  Customer 1       2.1      9.10
Purchase 3  Customer 2       3.8     11.10
Purchase 4  Customer 2       4.2      5.20
Purchase 5  Customer 3       5.5     44.66
Purchase 6  Customer 3       6.9    983.00

In [54]:
grouped_data = df14.groupby('customer')
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002747A0D73A0>

In [55]:
grouped_data.describe()

           product1                                           product2  \
              count mean       std  min   25%  50%   75%  max    count
customer
Customer 1      2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0
Customer 2      2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0
Customer 3      2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0


              mean         std    min      25%     50%      75%    max
customer
Customer 1    8.65    0.636396   8.20    8.425    8.65    8.875    9.1
Customer 2    8.15    4.171930   5.20    6.675    8.15    9.625   11.1
Customer 3  513.83  663.506577  44.66  279.245  513.83  748.415  983.0

In [56]:
grouped_data.mean()

            product1  product2
customer
Customer 1       1.6      8.65
Customer 2       4.0      8.15
Customer 3       6.2    513.83

In [57]:
grouped_data.std()

            product1    product2
customer
Customer 1  0.707107    0.636396
Customer 2  0.282843    4.171930
Customer 3  0.989949  663.506577

In [60]:
grouped_data.count()

            product1  product2
customer
Customer 1         2         2
Customer 2         2         2
Customer 3         2         2

In [61]:
#saving
df8.to_csv('df8.csv', index=True)

In [62]:
new_df8 = pd.read_csv('df8.csv', index_col=0) # <- index_col represents the column to be used as for index
new_df8

   customer  distance  sales
1       103         9    214
0       101        12    123
3       105        21    331
2       104        44    663

In [63]:
df8.to_excel('df8.xlsx', index=False, sheet_name='first sheet')
newer_df8 = pd.read_excel('df8.xlsx', sheet_name='first sheet')
newer_df8

   customer  distance  sales
0       103         9    214
1       101        12    123
2       105        21    331
3       104        44    663